Microchip-MPLAB-Harmony/smartenergy_prime_apps/apps/prime_apps/prime_dual_service_modem/src/packs/PIC32CX2051MTG128_DFP/component/slcdc.h
/* -------- SLCDC_LMEMR0 : (SLCDC Offset: 0x200) (R/W 32) LSB Memory Register (com = 0) -------- */
#define SLCDC_LMEMR0_LPIXEL_Pos               _UINT32_(0)                                          /* (SLCDC_LMEMR0) LSB Pixels Pattern Associated to COMx Terminal Position */
#define SLCDC_LMEMR0_LPIXEL_Msk               (_UINT32_(0xFFFFFFFF) << SLCDC_LMEMR0_LPIXEL_Pos)    /* (SLCDC_LMEMR0) LSB Pixels Pattern Associated to COMx Terminal Mask */
#define SLCDC_LMEMR0_LPIXEL(value)            (SLCDC_LMEMR0_LPIXEL_Msk & (_UINT32_(value) << SLCDC_LMEMR0_LPIXEL_Pos)) /* Assigment of value for LPIXEL in the SLCDC_LMEMR0 register */
#define SLCDC_LMEMR0_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (SLCDC_LMEMR0) Register Mask  */


/* -------- SLCDC_LMEMR1 : (SLCDC Offset: 0x208) (R/W 32) LSB Memory Register (com = 1) -------- */
#define SLCDC_LMEMR1_LPIXEL_Pos               _UINT32_(0)                                          /* (SLCDC_LMEMR1) LSB Pixels Pattern Associated to COMx Terminal Position */
#define SLCDC_LMEMR1_LPIXEL_Msk               (_UINT32_(0xFFFFFFFF) << SLCDC_LMEMR1_LPIXEL_Pos)    /* (SLCDC_LMEMR1) LSB Pixels Pattern Associated to COMx Terminal Mask */
#define SLCDC_LMEMR1_LPIXEL(value)            (SLCDC_LMEMR1_LPIXEL_Msk & (_UINT32_(value) << SLCDC_LMEMR1_LPIXEL_Pos)) /* Assigment of value for LPIXEL in the SLCDC_LMEMR1 register */
#define SLCDC_LMEMR1_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (SLCDC_LMEMR1) Register Mask  */


/* -------- SLCDC_LMEMR2 : (SLCDC Offset: 0x210) (R/W 32) LSB Memory Register (com = 2) -------- */
#define SLCDC_LMEMR2_LPIXEL_Pos               _UINT32_(0)                                          /* (SLCDC_LMEMR2) LSB Pixels Pattern Associated to COMx Terminal Position */
#define SLCDC_LMEMR2_LPIXEL_Msk               (_UINT32_(0xFFFFFFFF) << SLCDC_LMEMR2_LPIXEL_Pos)    /* (SLCDC_LMEMR2) LSB Pixels Pattern Associated to COMx Terminal Mask */
#define SLCDC_LMEMR2_LPIXEL(value)            (SLCDC_LMEMR2_LPIXEL_Msk & (_UINT32_(value) << SLCDC_LMEMR2_LPIXEL_Pos)) /* Assigment of value for LPIXEL in the SLCDC_LMEMR2 register */
#define SLCDC_LMEMR2_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (SLCDC_LMEMR2) Register Mask  */


/* -------- SLCDC_LMEMR3 : (SLCDC Offset: 0x218) (R/W 32) LSB Memory Register (com = 3) -------- */
#define SLCDC_LMEMR3_LPIXEL_Pos               _UINT32_(0)                                          /* (SLCDC_LMEMR3) LSB Pixels Pattern Associated to COMx Terminal Position */
#define SLCDC_LMEMR3_LPIXEL_Msk               (_UINT32_(0xFFFFFFFF) << SLCDC_LMEMR3_LPIXEL_Pos)    /* (SLCDC_LMEMR3) LSB Pixels Pattern Associated to COMx Terminal Mask */
#define SLCDC_LMEMR3_LPIXEL(value)            (SLCDC_LMEMR3_LPIXEL_Msk & (_UINT32_(value) << SLCDC_LMEMR3_LPIXEL_Pos)) /* Assigment of value for LPIXEL in the SLCDC_LMEMR3 register */
#define SLCDC_LMEMR3_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (SLCDC_LMEMR3) Register Mask  */


/* -------- SLCDC_LMEMR4 : (SLCDC Offset: 0x220) (R/W 32) LSB Memory Register (com = 4) -------- */
#define SLCDC_LMEMR4_LPIXEL_Pos               _UINT32_(0)                                          /* (SLCDC_LMEMR4) LSB Pixels Pattern Associated to COMx Terminal Position */
#define SLCDC_LMEMR4_LPIXEL_Msk               (_UINT32_(0xFFFFFFFF) << SLCDC_LMEMR4_LPIXEL_Pos)    /* (SLCDC_LMEMR4) LSB Pixels Pattern Associated to COMx Terminal Mask */
#define SLCDC_LMEMR4_LPIXEL(value)            (SLCDC_LMEMR4_LPIXEL_Msk & (_UINT32_(value) << SLCDC_LMEMR4_LPIXEL_Pos)) /* Assigment of value for LPIXEL in the SLCDC_LMEMR4 register */
#define SLCDC_LMEMR4_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (SLCDC_LMEMR4) Register Mask  */


/* -------- SLCDC_LMEMR5 : (SLCDC Offset: 0x228) (R/W 32) LSB Memory Register (com = 5) -------- */
#define SLCDC_LMEMR5_LPIXEL_Pos               _UINT32_(0)                                          /* (SLCDC_LMEMR5) LSB Pixels Pattern Associated to COMx Terminal Position */
#define SLCDC_LMEMR5_LPIXEL_Msk               (_UINT32_(0xFFFFFFFF) << SLCDC_LMEMR5_LPIXEL_Pos)    /* (SLCDC_LMEMR5) LSB Pixels Pattern Associated to COMx Terminal Mask */
#define SLCDC_LMEMR5_LPIXEL(value)            (SLCDC_LMEMR5_LPIXEL_Msk & (_UINT32_(value) << SLCDC_LMEMR5_LPIXEL_Pos)) /* Assigment of value for LPIXEL in the SLCDC_LMEMR5 register */
#define SLCDC_LMEMR5_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (SLCDC_LMEMR5) Register Mask  */


/* -------- SLCDC_LMEMR6 : (SLCDC Offset: 0x230) (R/W 32) LSB Memory Register (com = 6) -------- */
#define SLCDC_LMEMR6_LPIXEL_Pos               _UINT32_(0)                                          /* (SLCDC_LMEMR6) LSB Pixels Pattern Associated to COMx Terminal Position */
#define SLCDC_LMEMR6_LPIXEL_Msk               (_UINT32_(0xFFFFFFFF) << SLCDC_LMEMR6_LPIXEL_Pos)    /* (SLCDC_LMEMR6) LSB Pixels Pattern Associated to COMx Terminal Mask */
#define SLCDC_LMEMR6_LPIXEL(value)            (SLCDC_LMEMR6_LPIXEL_Msk & (_UINT32_(value) << SLCDC_LMEMR6_LPIXEL_Pos)) /* Assigment of value for LPIXEL in the SLCDC_LMEMR6 register */
#define SLCDC_LMEMR6_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (SLCDC_LMEMR6) Register Mask  */


/* -------- SLCDC_LMEMR7 : (SLCDC Offset: 0x238) (R/W 32) LSB Memory Register (com = 7) -------- */
#define SLCDC_LMEMR7_LPIXEL_Pos               _UINT32_(0)                                          /* (SLCDC_LMEMR7) LSB Pixels Pattern Associated to COMx Terminal Position */
#define SLCDC_LMEMR7_LPIXEL_Msk               (_UINT32_(0xFFFFFFFF) << SLCDC_LMEMR7_LPIXEL_Pos)    /* (SLCDC_LMEMR7) LSB Pixels Pattern Associated to COMx Terminal Mask */
#define SLCDC_LMEMR7_LPIXEL(value)            (SLCDC_LMEMR7_LPIXEL_Msk & (_UINT32_(value) << SLCDC_LMEMR7_LPIXEL_Pos)) /* Assigment of value for LPIXEL in the SLCDC_LMEMR7 register */
#define SLCDC_LMEMR7_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (SLCDC_LMEMR7) Register Mask  */


/** \brief SLCDC register offsets definitions */
#define SLCDC_CR_REG_OFST              _UINT32_(0x00)      /* (SLCDC_CR) Control Register Offset */
#define SLCDC_MR_REG_OFST              _UINT32_(0x04)      /* (SLCDC_MR) Mode Register Offset */
#define SLCDC_FRR_REG_OFST             _UINT32_(0x08)      /* (SLCDC_FRR) Frame Rate Register Offset */
#define SLCDC_DR_REG_OFST              _UINT32_(0x0C)      /* (SLCDC_DR) Display Register Offset */
#define SLCDC_SR_REG_OFST              _UINT32_(0x10)      /* (SLCDC_SR) Status Register Offset */
#define SLCDC_IER_REG_OFST             _UINT32_(0x20)      /* (SLCDC_IER) Interrupt Enable Register Offset */
#define SLCDC_IDR_REG_OFST             _UINT32_(0x24)      /* (SLCDC_IDR) Interrupt Disable Register Offset */
#define SLCDC_IMR_REG_OFST             _UINT32_(0x28)      /* (SLCDC_IMR) Interrupt Mask Register Offset */
#define SLCDC_ISR_REG_OFST             _UINT32_(0x2C)      /* (SLCDC_ISR) Interrupt Status Register Offset */
#define SLCDC_SMR0_REG_OFST            _UINT32_(0x30)      /* (SLCDC_SMR0) Segment Map Register 0 Offset */
#define SLCDC_WPMR_REG_OFST            _UINT32_(0xE4)      /* (SLCDC_WPMR) Write Protection Mode Register Offset */
#define SLCDC_LMEMR0_REG_OFST          _UINT32_(0x200)     /* (SLCDC_LMEMR0) LSB Memory Register (com = 0) Offset */
#define SLCDC_LMEMR1_REG_OFST          _UINT32_(0x208)     /* (SLCDC_LMEMR1) LSB Memory Register (com = 1) Offset */
#define SLCDC_LMEMR2_REG_OFST          _UINT32_(0x210)     /* (SLCDC_LMEMR2) LSB Memory Register (com = 2) Offset */
#define SLCDC_LMEMR3_REG_OFST          _UINT32_(0x218)     /* (SLCDC_LMEMR3) LSB Memory Register (com = 3) Offset */
#define SLCDC_LMEMR4_REG_OFST          _UINT32_(0x220)     /* (SLCDC_LMEMR4) LSB Memory Register (com = 4) Offset */
#define SLCDC_LMEMR5_REG_OFST          _UINT32_(0x228)     /* (SLCDC_LMEMR5) LSB Memory Register (com = 5) Offset */
#define SLCDC_LMEMR6_REG_OFST          _UINT32_(0x230)     /* (SLCDC_LMEMR6) LSB Memory Register (com = 6) Offset */
#define SLCDC_LMEMR7_REG_OFST          _UINT32_(0x238)     /* (SLCDC_LMEMR7) LSB Memory Register (com = 7) Offset */

